package org.andestech.learning.rfb18;


public class App 
{
    public static void main( String[] args )
    {
        /**
         * TODO:
         *
         * 1. Создать коллецию счетов из 50 счетов, где каждый счёт представлен в виде
         *    строки где первые 4 символа - буквенный код подразделения,
         *    остальные 12 - числа.
         *
         * 2. Отсортировать список по цифровой части счёта.
         *
         * 3. Записать отсортированный список в текстовый CSV файл.
         *
         *
         */


    }
}
